/*
 * @Author: guanlin.li guanlin.li@digitalbrain.cn
 * @Date: 2023-03-15 18:14:30
 * @LastEditors: guanlin.li guanlin.li@digitalbrain.cn
 * @LastEditTime: 2023-03-16 20:48:41
 * @FilePath: /huanghe/source/services/frontend/mock/service/services/id/monitor/GET.js
 * @Description: service 监控列表Mock
 */
/* eslint-disable @typescript-eslint/no-var-requires */
const utils = require('../../../../utils');
module.exports = function (req, res) {
  utils.ok(req, res, [
    {
      name: 'CPU使用率',
      data: [
        [
          '2023-03-15T14:30:00',
          '2023-03-15T16:30:00',
          '2023-03-15T20:30:00',
          '2023-03-16T02:30:00',
          '2023-03-16T12:30:00',
        ], // 时间戳（x轴），unix 整数
        [1.5, 2.5, 8.2, 10.0, 50.1], // 数值（y轴），浮点数（一位小数或整数）
      ],
      unit: '%', // 单位，字符串
    },
    {
      name: 'GPU使用率',
      data: [
        [
          '2023-03-15T14:30:00',
          '2023-03-15T16:30:00',
          '2023-03-15T20:30:00',
          '2023-03-16T02:30:00',
          '2023-03-16T12:30:00',
        ], // 时间戳（x轴），unix 整数
        [1.5, 2.5, 8.2, 10.0, 50.1], // 数值（y轴），浮点数（一位小数或整数）
      ],
      unit: '积分', // 单位，字符串
    },
    {
      name: '物理内存使用率',
      data: [
        [
          '2023-03-15T14:30:00',
          '2023-03-15T16:30:00',
          '2023-03-15T20:30:00',
          '2023-03-16T02:30:00',
          '2023-03-16T12:30:00',
        ], // 时间戳（x轴），unix 整数
        [1.5, 2.5, 8.2, 10.0, 50.1], // 数值（y轴），浮点数（一位小数或整数）
      ],
      unit: '积分', // 单位，字符串
    },
    {
      name: '流入速率',
      data: [
        [
          '2023-03-15T14:30:00',
          '2023-03-15T16:30:00',
          '2023-03-15T20:30:00',
          '2023-03-16T02:30:00',
          '2023-03-16T12:30:00',
        ], // 时间戳（x轴），unix 整数
        [1.5, 2.5, 8.2, 10.0, 50.1], // 数值（y轴），浮点数（一位小数或整数）
      ],
      unit: 'KB/s', // 单位，字符串
    },
    {
      name: '流出速率',
      data: [
        [
          '2023-03-15T14:30:00',
          '2023-03-15T16:30:00',
          '2023-03-15T20:30:00',
          '2023-03-16T02:30:00',
          '2023-03-16T12:30:00',
        ], // 时间戳（x轴），unix 整数
        [1.5, 2.5, 8.2, 10.0, 50.1], // 数值（y轴），浮点数（一位小数或整数）
      ],
      unit: 'KB/s', // 单位，字符串
    },
  ]);
};
